[
  {
    "id": "1",
    "name": "Daisy",
    "message": "Healed of Hip Displacement",
    "image": "/images/livest3.jpg",
    "text": "\"I thought I will never walk again, and God didn't love me.\" These are the words of Daisy, a recipient of one amazing healing miracle. She fell from a flight of stairs one time when walking and injured her leg. After some days she began to feel severe pain in her left leg which persisted for nineteen years. After review by doctors, she was told that her thigh bone had slipped out of the socket of the left leg upon falling and after some time, the right leg had suffered the same fate. She had multiple treatments for months but was never relieved. She even tried surgeries in the USA. Her right leg felt okay but her left leg never felt the same. \"I called my left leg my bad leg and my right leg my good leg.\" Due to this, she was unable to squat, bend, sleep on her left side, she couldn't even buckle her own shoe. No child of God should endure what she did - it was gruesome. This persisted until one day when she joined a meeting online, where the man of God Pastor David was ministering to people having localized pain in their body. Believing God for her healing, she stood up by the word of the man of God. Instantly she was healed.",
    "text2": "Her healing was reaffirmed after the man of God ministered to her in church. Instantly, she was able to squat, the pain was gone, she was able to do all that she could not do before. Glory to God! She is happy now, unafraid of what discomforts and traumas the pain could have brought. Most importantly, she knew that God truly did love her. \"I just knew that God really, really loves me.\""
  },
  {
    "id": "2",
    "name": "John Smith",
    "message": "Healed of PCOS, Ovarian Cyst, Fibroid, Ulcer, Asthma, Kidney Stones and Migraine - Dela",
    "image": "/images/livest2.jpg",
    "text": "\"The left part of my abdomen usually becomes hard and I was diagnosed with PCOS, Ovarian Cyst, Fibroid, Ulcer, Asthma, Kidney Stones and Migraine. I was booked for surgery for the Fibroid and the Ovarian cyst some days after the program. During the TalkShow segment, when I heard the testimony about the Cyst, I told myself that I will receive my own testimony before I leave this place.\"",
    "text2": "When the Man of God called for anyone that has been feeling a deep abdominal pain that has lingered for some time, I came forward and I was touched by the Power of the Holy Ghost. Instantly I could bend; something I hadn't been able to do in a very long time. My breath is now stable and I cannot feel the pain in my abdomen anymore. Glory be to God forever.\""
  }
]
